<script>
    /*
        \n 은 줄바꿈이다.  구분자도 (\n 으로 넣으면 잘잘린다.)

         문제1) 위 데이터 는  각각의 회원이 물건을 구입가격들 을 기록한 내용이다.
		 		회원별 구입 총합을 테이블로 만들려고한다.
			    데이터는 아래와 같이 나올수있도록 result 에 저장후 출력 
				
				10001 김철수 2670
				10002 이영희 1950 
				10003 유재석 4080
				10004 박명수 7130
    */
    var data ="";
		data += "10001/김철수/600\n";
		data += "10002/이영희/800\n";
		data += "10001/김철수/1400\n";
		data += "10003/유재석/780\n";
		data += "10002/이영희/950\n";
		data += "10004/박명수/330\n";
		data += "10001/김철수/670\n";
		data += "10003/유재석/3300\n";
		data += "10002/이영희/200\n";
		data += "10004/박명수/6800\n";
		data = data.substring(0 , data.length-1); // 마지막 글삭제 
		console.log(data);
    var result;
  </script>