"""
    [문제] 
        랜덤숫자 10000~90000 사이의 숫자를 저장하고,
         각자리별로 검사하여 5의 개수를 출력 

    [예시]
        45635 => 2개
        12386 => 0개
"""

print("!문제1!")
import random

num = random.randint(10000,90000)

num_10000 = num // 10000
num_1000 = num % 10000 // 1000
num_100 = num % 1000 // 100
num_10 = num % 100 // 10
num_1 = num % 10

count = 0


if num_10000 == 5:
    count += 1

if num_1000 == 5:
    count += 1

if num_100 == 5:
    count += 1

if num_10 == 5:
    count += 1

if num_1 == 5:
    count += 1

print("랜덤숫자 :",num)
print("5의 개수:", count)
print("===================================")
"""
    [문제]
        a리스트에서 십의 자리가 짝수이고, 일의 자리가 홀수인수만 출력  
        a = [510,423,124,512,252,23,312,453,122]
    [정답]
        423
        23
"""
a = [510,423,124,512,252,23,312,453,122]

print("!문제2!")

for i in range(len(a)):
    if (a[i]%100//10)%2 == 0 and (a[i]%10)%2 != 0:
        print("정답:",a[i])
