
var jsonArr = [
    { "num": 1001, "name": "김철수", "math": 10, "eng": 20, "kor": 30 },
    { "num": 1002, "name": "박민정", "math": 40, "eng": 60, "kor": 10 },
    { "num": 1003, "name": "이상아", "math": 15, "eng": 10, "kor": 50 },
    { "num": 1004, "name": "조민수", "math": 16, "eng": 40, "kor": 20 },
]

/*
    
    [문제1]
        국어점수가 수학점수 보다 높은 학생들 번호 이름 출력 

    [문제2]
        국어 수학 영어 세과목의 평균이 30점이상이면  합격이다
        win 항목을 추가하고 합격이면 true , 불합격이면 false 추가 
      
    [문제3]
        rank 항목을 추가하고 총합에대한 등수 저장 
*/



