#1. 학생 테이블의 모든 열을 검색하라

#2. 학생 테이블의 이름, 학년, 주소 열만 선택적으로 검색하라

#3. 학생 테이블의 이름과 주소 열만 검색하라

#5. 학생 번호가 1인 학생을 검색하라

#6. 키가 165 미만인 학생을 검색하라

#7. 1학년이고 동시에 키가 170 이상인 학생의 이름, 학년, 키, 몸무게 을 검색하라

#9. 몸무게 45보다 크거나 같고 50보다 작거나 같은 학생의 이름, 주소, 키, 몸무게을 검색 

#11. 학생의 번호, 이름, 학년을 검색하라

#12. 학생의 번호, 이름, 학년을 검색하라

#13. 박씨 성을 가진 학생을 검색하라

#14. 김씨, 이씨, 박씨 성을 가진 학생 모두를 검색하되 반드시 LIKE 연산자를 사용하라

#18. 학생 테이블에서 모든 열에 저장된 데이터를 검색하되, 이름 가나다순으로 정렬하여 출력하라

#19. 학생의 이름, 주소, 키 데이터를 검색하되 키가 큰 학생부터 출력하라

#20. 1학년 학생의 이름, 학년, 주소, 몸무게 데이터를 검색하라(단 ,반드시 체중이 적은 학생부터 출력하라)

#21. 1학년 학생의 이름, 학년, 키, 몸무게 데이터를 검색하라(단, 키 내림차순으로 정렬하고, 같은 키는 몸무게 오름차순으로 정렬)

#22. 학생의 번호, 이름, 주소를 검색하되 이름을 가나다 순으로 정렬해라

#23. 학생 테이블에서 '보아' 학생과 학년이 동일한 모든 학생의 이름과 키, 몸무게를 검색하라

#24. 1번 학과 학생들의 평균 키보다 작은 학생의 이름, 학년, 키를 검색하라

#25. '김태희' 학생과 학년이 같고, '김태희' 학생보다 큰 학생의 이름, 학년, 키를 검색

#26. 키가 165인 학생의 번호, 이름, 키를 검색하라

#27. 학생의 수를 검색하라

#29. 번호가 1인 과목의 평균 점수를 검색하라

#30. 과목별 평균 점수를 검색하라

#32. 누적학생 수가 네 명 이상인 과목의 평균 점수를 검색하라

#34. 학생들의 학번, 이름, 소속학과 이름을 검색하라

#35. 교수의 번호, 이름, 소속 학과 이름을 검색하라

#36. '채영' 학생의 번호, 이름, 소속 학과 이름을 검색하라

#37. 키가 180 이상인 학생의 번호, 이름, 키, 소속 학과 이름을 검색하라

#38. 학점에A가 포함된학생들의 이름 출력 