
"""
[문제]
    (1~20)사이의 랜덤숫자를 a, b, c 에 각각 저장후출력한다.
    a 와 c중 어느 값이 b와 더 가까운지 출력하시오. 
[예시]
    a:  18  
    b:  6  
    c:  8
    "c가 b에 더 가깝다"
"""
print("--문제1--")

"""
[문제]
	1~200 사이의 랜덤숫자를 저장하고 다음과 같이 출력하시오.
	
	랜덤 숫자가
	1~10 	사이 값이면, 5
	11~20	사이 값이면, 15
	21~30	사이 값이면, 25
	......
	101 ~ 110 사이 값이면, 105
[예] 
		5   ==> 5
		10  ==> 5
		11  ==> 15
		20  ==> 15
		24  ==> 25
		30  ==> 25
		104 ==> 105
		154 ==> 155
"""
print("--문제2--")

'''
[문제]
	민수네 반 학생은 26명이다.
	민수네반 학생들에게 도화지를 2장씩 색종이를 30장씩 나눠주려고한다.
	도화지는 열장씩 묶음으로만 판매하고 있고, 한 묶음에 1200원이다.
	색종이는 백장씩 묶음으로만 판매하고 있고, 한 묶음에 3200원이다.
    각각  얼마가 필요한지구하시오.
[정답]
    7200   25600
'''
print("--문제3--")








