"""
[문제]
	철수는 농구공을 18번던저 11번 성공했다.
	철수의 성공 확률을 출력하시오.
"""
"""
[문제]
	432122 초를 시간을 제외한 분만 출력하시오.

"""
"""
[문제]
	철수는 12초에 100미터를 달린다.
	철수의 시속을 구하시오. 
	단, 철수는 일정한속도로 달린다.
"""
"""
[문제]	
	자동차 카센터에는 수리를 기다리는 오토바이와 자동차가 있다.
	오토바이와 자동차를 합쳐서 21대가 있다.
	바퀴는 합쳐서 70개 일때 오토바이와 자동차의 대수를 구하시오.
"""
"""
[문제]
	택시 기본요금은 10700원이다.		
    기본요금으로는 11km까지 이동할 수 있다.
    11km 초과 이동 시 추가 요금이 발생한다. 		
    추가 요금은 3km 이동할 때마다 2700원씩 요금이 추가된다.			
    랜덤으로 이동거리 1~30을 저장하고 해당 요금을 출력 
"""
"""
[문제]
    1부터 100사이의 랜덤숫자를 변수a에 저장한다. 
    a의 값이 1~5사이면 b에 95 저장후 출력
    a의 값이 6~10사이면 b에 90 을저장후 출력 
    a의 값이 11~15사이면 b에 85 를저장후 출력
    ....
    ....
    a의 값이 91~95 사이면 b에 5를 저장후 출력
    a의 값이 96~100 사이면 b에 0을 저장후 출력 
"""
"""
[문제]
    [1] 10000~90000 사이의 랜덤 숫자 저장한다.
	[2] 각각의 자리별 짝수의 개수를 출력하시오.
"""

"""
[문제]
    80의 약수들 중에서 짝수의 합과 개수를 출력하시오.
"""
"""
	[문제] 
	   	1000보다 큰 수중에서 12의 배수를 검색하고, 
     	십의자리가 4인 수를
		가장 작은 수부터 차례대로 4개를 출력하시오. 
"""

"""
[문제]
    중학생인 미연이는 부모님과 함께 미술관에 갔다.
    어른의 입장료가 청소년의 입장료보다 2,000원이 더 비싸고,
    세 사람의 입장료가 13,000원일때, 미연이의 입장료를 구하시오.
[정답]
    미연
"""

"""
[문제]
    [조건1] 25와 80의 약수를 전부 출력하고,
    [조건2] 두 약수들 중에서 서로 같은수만 출력하시오. 
"""

'''
[문제]
    1~10 사이의 랜덤 숫자 5개 저장하고
    그 숫자의 합이 무조건 30이 되도록 출력해보자.
'''
'''
[문제]
    100 ~ 999 사이의 숫자를 랜덤으로 3개 출력한다. 
    단, 전부 각각의숫자마다 숫자5가 포함되어야한다. 

'''

'''
[문제]
	랜덤으로 1~5 사이의 숫자를 저장한다. 
    랜덤숫자가 나오면 그숫자만큼 아래와같은 패턴으로 출력하시오.

[예시]
    1 => 1 2 3 4 5 

    2 => 1 1 2 2 3 3 4 4 5 5 

    3 => 1 1 1 2 2 2 3 3 3 4 4 4 5 5 5 

    4 => 1 1 1 1 2 2 2 2 3 3 3 3 4 4 4 4 5 5 5 5 

    5 => 1 1 1 1 1 2 2 2 2 2 2 3 3 3 3 3  4 4 4 4 4 5 5 5 5 5 

'''

'''
[문제]
    a = [] 
    a리스트에 1~5사이의 랜덤숫자 15개를 저장한다.
    숫자 1 2 3 이 연속으로 나오면 당첨이라고 할때,
    당첨이 몇번나왔는지 출력하시오.
[예시]

    a = [1, 5, 2, 1, 2, 3, 3, 2, 1, 4, 1, 2, 3, 4, 2] 
    당첨: 2번
'''

