'''
	[문제 1]
		철수와 영희는 가위바위보 게임을 하고 있다. 
		규칙은 아래와 같다.	
		
		이기면 계단을 3칸 올라간다.
		지면 계단을 2칸 내려간다.
		비기면 아무 일도 생기지 않는다. 
		계단은 총 100계단이다. 
		
		50번째 계단에서 게임을 시작한다.
		
		철수는 4번 이기고 2번 졌다.
		철수의 현재위치를 구하시오.		
	[정답] 
		58
'''

print("1.",(4*3)-(2*2)+50,"번째 계단")

#----------------------------------------------------

'''
	[문제 2]	  	
		사과 한 개의 무게는 140.1g 이다.
		귤 한개의 무게는 78.32g 이다.	  	
		두 과일의 무게 합을 구하시오.
	[정답] 
		218.42
'''

print("2.",140.1+78.32, "g")

#----------------------------------------------------

'''
	[문제 3]	  	
		철수는 현금 10000원을 가지고 마트에 갔다.
		사과 한 개의 가격은 200원이고, 귤 한 개의 가격은 110원이다. 
		사과 3개와 귤 10개를 사려고 한다 .  
		모두 사면 거스름돈은 얼마인지 구하시오.
	[정답]
		8300
'''

print("3.",10000-((200*3)+(110*10)),"원")

#----------------------------------------------------

'''
	[문제 4]	  	
		철수네 반 학생은 총 31명이다. 
		남학생은 17명이면 여학생은 몇 명인지 구하시오.			
	[정답] 
		14
'''

print("4.",31-17, "명")

#----------------------------------------------------

'''
	[문제 5]	  	
		철수는 집에서 학원에 들려서 학교 운동장까지 걸어갔다가 돌아왔다.
                집에서 학원까지의 거리는 300m이고,
                학원에서 학교 운동장까지의 거리는 821m이다. 
                철수가 왕복한 거리는 얼마인지 구하시오.
	[정답] 
		2242 
'''

print("5.",(300+821)*2, "m")

#----------------------------------------------------

'''
	[문제 6]	  	
		철수는 학용품 정리를 하고 있다.
		가지고 있는 지우개와 볼펜과 연필을 모두 합치니 27개였다.
		지우개는 12개이고 볼펜이 7개라고 하면, 
		연필은 모두 몇 개인지 구하시오.
	[정답] 
		8
'''

print("6.",27-12-7, "개")

#----------------------------------------------------
