/*
	[문제]
		출력문 을 사용해서 집 , 동물 , 꽃 등등을 그려보세요.
	
		       ------------------
		      /\                 \
		     /  \                 \
		    /    \                 \
		    ------------------------
		     |   |      _____     |
		     |   |      |_|_|     |
		     |   |      |_|_|     |
		     |   |                |
		     ----------------------		     	        
*/

console.log("\t   ------------------");
console.log("\t  /\\           ___   \\");
console.log("\t /  \\          |_|    \\");
console.log("\t/    \\                 \\");
console.log("\t-------------------------");
console.log("\t |   |      _____     |");
console.log("\t |   |      |_|_|     |");
console.log("\t |   |      |_|_|     |");
console.log("\t |   |                |");
console.log("\t-------------------------");
