'''
	[문제] 
		철수는 일정한 빠르기로 운동장을 도는데 4바퀴에 48분이 걸린다. 
		민수는 일정한 빠르기로 운동장을 도는데 7바퀴에 1시간 24분이 걸린다. 	
		철수와 민수가 똑같이 3바퀴를 돈다면 그 차이는 몇 분 인지 구하시오.
        소수점 2자리까지 구하시오.	
'''
'''	
[문제]
	1~200 사이의 랜덤숫자를 저장하고 다음과 같이 출력하시오.
	
	랜덤 숫자가
	1~10 	사이 값이면, 3
	11~20	사이 값이면, 13
	21~30	사이 값이면, 23
	......
	101 ~ 110 사이 값이면, 103
	
	[예] 
		5   ==> 3
		10  ==> 3
		11  ==> 13
		20  ==> 13
		24  ==> 23
		30  ==> 23
		104 ==> 103
		154 ==> 153
'''


"""
[문제]
    랜덤으로 숫자 100~999 사이의 숫자 3개를 출력한다. 
    단, 숫자는 3의 배수여야한다.  

"""